[
  //China - Qin
  {
       "name":"Qin Dynasty",
       "leaderName":"Qin Shi Huang",
       "adjectives":["Chinese - Qin"],
       "startBias":["None"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Taoism",

       "startIntroPart1":"Oh, wise and mighty Qin Shi Huangdi, the king of Qin and first Emperor of united China. Qin was an ancient Chinese state established in ninth century before Christ. During the early Warring States period, Qin's underdevelopment and decline had resulted in territorial losses to the Wei Kingdom. But then began a time of reformation in the legal, economic and social systems. The aristocracy system was abolished, all slaves granted citizenship rights, and meritocracy was practised in the military. Focus on increasing agricultural output resulted in major population growth, and the possibility of creating a larger army. Qin rose to prominence and emerged as one the dominant superpower among the Seven Warring States. The final advantage they needed to spread their supremacy over all China was a wise king with an unyielding will. You were that unyielding will, and China has been greatful ever since.",
       "startIntroPart2":"The eternal glory of Qin Shi Huang, whose wisdom created countless wonders, many declared impossible, is challenged once more. Can your greatness unify the warring states of Earth and make them one under the heaven? Can you succeed where once you failed, and discover the secret of eternal life? Can you build a civilisation that will stand the test of time?",

       "introduction":"You are allowed to approach the Emperor to within a hundred paces! What an honour for a nameless visitor! Why have you come?",
       "declaringWar":"How dare you enrage the might of heaven! I will send my great army, desecrate your ancestral shrines, eliminate your people. I swear I won't restrain them!",
       "attacking":"Fight me if you have the courage. Soon I will bring my army to teach you a lesson and kill you!",
       "defeated":"I was sure eternal life... would be mine... this... time...",
       "afterPeace":"It seemed that we are equal in strength, might as well stop this to strengthen us more. I would like to see you in the next battle!",
       "tradeRequest":"I decided to give you a piece of my empire to you. Hope you like it.",

       "outerColor":[1,133,135],
       "innerColor":[192,24,64],

       "uniqueName":"All Under Heaven",
       "uniques":
           ["Causes [Resistance] in [enemy cities] if [Qin Dynasty]'s [military power] <in the area> is <greater than> the [defender]'s"],
       "cities": ["Xianyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Luoyang"],
  },
  //China - Wu Zhou
  {
       "name":"Wu Zhou Dynasty",
       "leaderName":"Wu Zetian",
       "adjectives":["Chinese - Wu Zhou"],
       "startBias":["None"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The Blessings of Heaven be upon you. Empress Wu Zetian, most beautiful and haughty ruler of China! Oh great Empress, whose shadow causes the flowers to blossom and the rivers to flow! You are the only empress of the Chinese, the oldest and the greatest civilization that humanity has ever produced. China's history stretches back into the mists of time, its people achieving many great things long before the other upstart civilizations were even conceived. China's contributions to the arts and sciences are too many and too wondrous to do justice to - the printing press, gunpowder, the works of Confucius - these are but a few of the gifts China has given to an undeserving world!",
       "startIntroPart2":"You, great Empress, who, with cunning and beauty, rose from the position of lowly concubine to that of Divine Empress - your people call out to you to lead them! Great China is once again beset on all sides by barbarians. Can you defeat all your many foes and return your country to greatness? Can you build a civilisation that will stand the test of time?",

       "introduction":"Salutations to you, I am Empress of all China, China is not something you can meddling with. We want peace, so do you.",
       "declaringWar":"Oh, believe me, you won't ever be able to bother me one more time! Go meet Yama and say hi to him! Hahahaha!",
       "attacking":"You fool! I will disembowel you all!",
       "defeated":"Oh my, you have proven yourself to me that you are truly a cunning and competent advesary to China. Well, I congratulate you on your victory, but I assured you, China will rise again.",
       "afterPeace":"Well, it seems there's no other options other than peace, oh well, guess it will be commenced.",
       "tradeRequest":"Oh, friend of mine, what do you think of this request of trade?",

       "outerColor":[202,20,21],
       "innerColor":[247,216,1],

       "uniqueName":"Art of War",
       "uniques":
           ["The [Great General] [combat bonus] <is increased> by [15%], and their [spawn rate] <is increased> by [50%]"],
       "cities": ["Luoyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang"],
  },
  //China - Ming
   {
       "name":"Ming Dynasty",
       "leaderName":"Zhu Di (Yongle)",
       "adjectives":["Chinese - Ming"],
       "startBias":["None"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Eternal happiness to you, Yongle, great Emperor of the Ming. Overcoming the treachery of your nephew, the Jianwen Emperor, you launched a campaign to seize China and restore it to greatness. Guided by your loyal and ever-watchful Scholar-Eunuchs, your imperial rule oversaw immeasurable splendour: the construction of great wonders, the advancement of deep knowledge, and the projection of China's power through the legendary Seven Voyages of Zhu Di.",
       "startIntroPart2":"At no other time before would China be so prosperous. Heavenly emperor, the legends of China's great accomplishments threaten to fade into memory. Can you be a patron to scholars and explorers alike? Can you show the world that China is both powerful and wise? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings, I am the Yongle Emperor. Those who trades are all friends of mine, and those who threatens me can only know my wrath upon themselves. So, what bring you to China?",
       "declaringWar":"Conquest is not my forte, or my choice of action. But you proven to me that there's no alternatives, so be prepared.",
       "attacking":"Hahahaha, you might as well conquer the kingdom of heaven! Let's see if your arrows can fly that high, and hurt that much!",
       "defeated":"The road ahead of me is dark, the pines are like walls that blocked my view. The sky above and the earth below, I can't see it as if it was lacquer. I have lost the mandate to rule this land and it passes to you.",
       "afterPeace":"It seems that peace is the only option. And I felt that it is good, I'll let it happened.",
       "tradeRequest":"Greetings, I offer you trade of wealth among us. What do you think of this offer?",

       "outerColor":[1,42,108],
       "innerColor":[247,216,1],

       "uniqueName":"Imperial Eunuchs",
       "uniques":
           ["[Specialists] generate [+2] [Great Person Points] <in cities with a [Spy]>. Receive an extra [Spy] <when meeting [50%] of the [city-states]> and <when meeting [100%] of the [city-states]>."],
       "cities": ["Nanjing","Shuntian","Fuzhou","Guangzhou","Guilin","Guiyang","Kaifeng","Wuchang","Nanchang","Xi'an","Jinan","Taiyuan","Chengdu","Kunming","Hangzhou","Fengyang","Baoding","Yanzhou","Pingyang","Luoyang","Fengxiang","Baoning","Ruizhou","Hanyang","Jiande","Xinghua","Zhaoqing","Pingle","Nanning","Anshun"],
       "spyNames": ["Wang","Zhou","Tian","Wu","Nguyen","Gang","Feng","Wei","Liu","Wanli"],
   },
  //China - Republic
   {
       "name":"Republic of China",
       "leaderName":"Sun Yat-sen",
       "adjectives":["Chinese - Republic"],
       "startBias":["None"],
       "preferredVictoryType":"Diplomatic",
       "favoredReligion":"Confucianism",

       "startIntroPart1":"May the glory of China be upon you, glorious Sun Yat-sen, Father of modern China and Forerunner of the Revolution. Influenced much by the ideals you found during your education in Hawaii, after studying medicine, you became a political philosopher, entering revolutionary groups and forming your own, such as the Four Bandits, which grew ever increasingly frustrated with the perceived backwardness of the Qing. After a number of exiles and rebellions, and establishing your political philosophy of the Three Principles of the People, you served as both provisional president and, later, de facto ruler of the Republic of China.",
       "startIntroPart2":"President Sun, the people of China need you once more. One of the only modern leaders of China to be revered in both the modern Republic and People's Republic, they need your strength, tenacity, and courage. Your people call for you once more. Will you be able to live up to your legacy, and build your own Republic without slipping into chaos? Can you build a civilization that will stand the test of time?",

       "introduction":"Hello, I am Sun Yat-sen, representative of this vast, populus republic of China. It may seem like I'm the one in charge here, but I merely speak for the people.",
       "declaringWar":"I do not want any conflict, but you showed that you are untrustworthy, so there's no other options but war.",
       "attacking":"Well, if my words are not enough for you, then force it is. I'll wait for you at the battlefield.",
       "defeated":"You have doomed China for years to come. I was able to successfully unite China for the greater good- just for the people to become divided once more at your hand.",
       "afterPeace":"Peace will be commenced, I waited for this moment for a long time. You showed yourself your skills right there, I'm impressed, to be honest.",
       "tradeRequest":"Hi, I want to inform you of my request of trade. What do you think, is this suitable for you?",

       "outerColor":[164,167,111],
       "innerColor":[176,51,37],

       "uniqueName":"Zhonghua Revival",
       "uniques":
           ["Gain additional [Production] and [Culture] <for each [terrain], [feature] and [improvements] controlled by a city>. [Border growth] is doubled <during [Golden Ages]>"],
       "cities": ["Guangzhou","Beijing","Taiyuan","Shanghai","Changsha","Nanjing","Chongqing","Shenyang","Chengdu","Wuhan","Taipei","Kaifeng","Suzhou","Guiyang","Xi'an","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang","Harbin","Uliastai","Fengtian","Xining"],
       "spyNames": ["Song","Huang","Cai","Li","Yang","Yin","Zhang","Wang","He","Qiu"],
  },
  //China - People's Republic
   {
       "name":"People's Republic of China",
       "leaderName":"Mao Zedong",
       "adjectives":["Chinese - People's Republic"],
       "startBias":["None"],
       "preferredVictoryType":"Domination",

       "startIntroPart1":"Salutations, Chairman Mao Zedong. Through your teachings and your leadership, you led a successful revolution in China, ending millennia of dynastic rule, imperialist influence, and internal strife in favor of the world’s most successful Communist state. Embroiled in a civil war against those who saw a different path for China, you made a temporary truce to halt the advance of the imperialist Japanese.  Just a few years after, you took Beijing and formed the People’s Republic of China, now a stable and prosperous state, the most populous country in the world.",
       "startIntroPart2":"Chairman, your people call for you once again. Will you continue to provoke radical thought among your people? Will you help preserve the new China in a world of conflict? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings, Comrade! I am Mao, Chairman of the People's Republic of China.",
       "declaringWar":"Your untrustworthiness showed that no one can ever sided with you. I will let you think of what you've done to China!",
       "attacking":"You! I'll show you the might of the Chinese People's Army!",
       "defeated":"Classes struggle, some classes triumph, others are eliminated. Such is history; such is the history of civilization for thousands of years. *coughs* I feel ill. Call the doctors now!",
       "afterPeace":"Oh well, I do want peace with you for now. I will still watching all your moves and motives.",
       "tradeRequest":"Comrade, are you interested in the wealth I'm trading with you here?",

       "outerColor":[174,38,24],
       "innerColor":[233,210,131],

       "uniqueName":"The Long March",
       "uniques":
           ["[Land] units generate [1] [Culture] per [tile] moved <in enemy territory>. Units below [33%] health receive [+1] [Movement] and [+2] [Movement] <when on [Hills] tile>"],
       "cities": ["Beijing","Shanghai","Tianjin","Chongqing","Guangzhou","Shenzhen","Wuhan","Chengdu","Dongguan","Nanjing","Harbin","Xi'an","Senyang","Linzi","Suzhou","Qingdao","Jinan","Zhengzhou","Hangzhou","Dalian","Kunming","Xiamen","Changchun","Nanning","Taiyuan","Hefei","Changzhou","Changsha","Wenzhou","Guiyang","Fuzhou","Shijiazhuang"],
  },
  //Japan - Ashikaga Yoshimitsu
   {
       "name":"Ashikaga Shogunate",
       "leaderName":"Ashikaga Yoshimitsu",
       "adjectives":["Japanese - Yoshimitsu"],
       "startBias":["Hills"],
       "preferredVictoryType":"Religious",
       "favoredReligion":"Shinto",

       "startIntroPart1":"Divine blessings of heaven shower upon you, great Ashikaga Yoshimitsu, Shogun of Japan! Your clan has risen from obscurity to the heights of power, recognised as the true ultimate authority in your fractured country. It was your guidance that brought the rebellious Southern Court to heel, favourably ending the violent imperial schism that had plagued your country for decades. You oversaw the construction of wondrous temples in Kyoto, still recognised as works of beauty to this day. Diplomatically you were unmatched, forging beneficial trade agreements with China and Korea to last a century. Truly, your benevolent guidance brought prosperity to your once fractured realm, and it is no wonder you were known as the true King of Japan!",
       "startIntroPart2":"Great Yoshimitsu, your successors could not replicate your glory. Soon Japan devolved into civil warfare on an unprecedented scale, and the name Ashikaga was tainted with weakness and impotence. Once more Japan needs your steady hand, to assert your birthright as Shogun! Will you restore your people's faith, and bring Japan into a new golden age? Will you build a civilization to stand the test of time?",

       "introduction":"The humble Yoshimitsu, third Shogun of clan Ashikaga, greets you, leader. Japan wishes for peace, but is unmatched in war.",
       "declaringWar":"Your path of action has made your unredeemable. Prepare for war!",
       "attacking":"You don't know your limits, don't you... I will make sure you receive your punishment for being too arrogant.",
       "defeated":"Regrettable... It seems Japan is destined for death and destruction once more...",
       "afterPeace":"The calmness of peace really delighted this humble one. I hope you have learnt your mistakes after the war.",
       "tradeRequest":"Greetings, leader. This humble one offers you a trade offer.",

       "outerColor":[176,143,62],
       "innerColor":[69,35,7],

       "uniqueName":"Five Mountains and Ten Monasteries",
       "uniques":
           ["[Religious] buildings provide additional [Happiness], and are instantly constructed <in conquered cities> <if present in the [Capital]>. Receive a random [Faith] building <during a [Golden Age]>"],
       "cities": ["Kyoto","Kamakura","Nara","Dazaifu","Gifu","Echizen","Ise","Funai","Ashikaga","Izumo","Kawagoe","Nagano","Yamagata","Fukuhara","Tokushima","Otsu","Tottori","Kokura","Yamaguchi","Tomo","Kiyosu","Katsuyama","Sannohe","Matsumae"],
       "spyNames": ["Takauji","Katsumoto","Moronao","Yoshimasa","Yoriyuki","Masanaga","Masamoto","Takamitsu","Sesshu","Motokiyo"],
  },
  //Japan - Tokugawa Ieyasu
   {
       "name":"Tokugawa Shogunate",
       "leaderName":"Tokugawa Ieyasu",
       "adjectives":["Japanese - Ieyasu"],
       "startBias":["None"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Great Shōgun Tokugawa Ieyasu, you know well that the patient blade is the one that will strike home. Guard your homeland carefully from usurpers domestic and foreign, and trust in the industry and resourcefulness of your people, for they alone can be relied upon. The task of rule is one that is long, and its burdens are heavy, but there is no room for discontent, nor for despair, with your hand upon the sword.",
       "startIntroPart2":"Legendary Daimyo and then Shogun, will you grab the reins of destiny? Will you bring your family and people honor and glory? Will you once again pick up the sword and shield and march to triumph? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings upon you, this humble one is Tokugawa Ieyasu, the Shogun of Japan. Without my commands, nothing will ever happen. What brought you here?",
       "declaringWar":"A sword that has a sharp edge will cut through the empty void, and a breeze blows amidst the raging fire showed its resilience. Between you and me, war is inevitable.",
       "attacking":"Approach me, I dare you, as you need to be cautious. I'll wait for you at the battlefield, and see if you let anywhere unchacked.",
       "defeated":"The grasses of summer is all a warrior can dream of after every battle. And now, it remains in my dreams.",
       "afterPeace":"I respect you and your skills, Japan awaits for the next encounter, peace or war, it will still awaits.",
       "tradeRequest":"Greetings upon you, this humble one requests you of a trade offer. How's that sound?",

       "outerColor":[189,161,27],
       "innerColor":[0,0,0],

       "uniqueName":"Sakoku",
       "uniques":
           ["Gain [1] [Culture], [Science] and [Gold] per tile with [Road], [Railroad] or [Bakuhan]."],
       "cities": ["Edo","Kyoto","Osaka","Nagoya","Fukuoka","Sendai","Shizuoka","Okayama","Takamatsu","Yokohama","Nagano","Otsu","Aomori","Fukushima","Morioka","Hakodate","Kobe","Fukui","Yamagata","Kagoshima","Hiroshima","Matsumoto","Ōta","Sapporo","Nagasaki","Tottori"],
  },
  //Japan - Meiji
  {
       "name":"Japanese Empire",
       "leaderName":"Meiji",
       "adjectives":["Japanese - Meiji"],
       "startBias":["Coast"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Shinto",

       "startIntroPart1":"May the sun rise with you, beloved Meiji Emperor - ruler of the Empire of Japan. When you ascended to the Chrysanthemum Throne at the age of 15, Japan was but a nation suspended in time; divided by its medieval Shogunates and ignorant of the ever Westernising world. During your reign, Japan would undergo one of the most dramatic shifts in history. Opening her borders to trade with the West, Japan would adapt rapidly to the Industrial Revolution of the previous century, reforming her government, her economy, and her armies to meet the standards of modernity. By the time of your death in 1912, Japan had become one of the foremost powers in Asia, setting the stage for a colonial empire that would come to dominate the Pacific.",
       "startIntroPart2":"Great Emperor, Japan stands once more divided and alone. Can you unite the Japanese people as one and embrace them in a golden age to last the ages? Can you build a civilisation that will stand the test of time?",

       "introduction":"You are welcome in the lands of Japan, but you must pledge your honesty and your honour to my name before I would speak with you.",
       "declaringWar":"Your incompetence, your arrogance and your untrustworthiness has led me to the only option I could think, war.",
       "attacking":"I see, you want Japan to succumb in front of you. Well, prepare for the wind of god.",
       "defeated":"It is only I that does this nation great dishonour. I am a servant to my defeat, but I beg you kindness upon my oppressed people.",
       "afterPeace":"Lucky for you that I accept your peace deal, because I hardly make peace without careful consideration.",
       "tradeRequest":"Salutations to you, I am interested in a trade with you. What do you think?",

       "outerColor":[127,0,22],
       "innerColor":[199,169,55],

       "uniqueName":"Imperial Reverence",
       "uniques":
           ["[+20%] [Culture] and [Production] <during [Golden Ages]>. [Military] units trained <in a [Golden Age]> begins with [+15] [XP]."],
       "cities": ["Tokyo","Osaka","Kyoto","Nagoya","Kanazawa","Hiroshima","Yokohama","Wakayama","Sendai","Tokushima","Hagi","Shuri","Toyama","Kumamoto","Fukuoka","Kobe","Fukui","Kochi","Sakai","Akita","Matsue","Niigata","Takamatsu","Okayama","Shizuoka","Nagasaki","Hakodate","Kagoshima","Akamazeki","Amagasaki","Otaru","Kawasaki","Yokosuka","Sapporo","Sasebo","Kokura","Miyahara","Yahata"],
       "spyNames": ["Kido","Sakamoto","Saigo","Ogaki","Yodo","Kuroishi","Nobuko","Sachiko","Masako","Nakayama"],
  },
  //Japan - Hideki Tojo
  {
       "name":"Great Empire of Japan",
       "leaderName":"Hideki Tojo",
       "adjectives":["Japanese - Hideki Tojo"],
       "startBias":["Coast"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Shinto",

       "startIntroPart1":"Hideki Tojo, by the grace of His Imperial Majesty, Prime Minister to Japan and her empire, you stand at the charge of a burgeoning war machine. At the turn of the 20th century, the Empire of Japan had rapidly transformed into an industrial and military superpower, and she sought now an empire like those possessed in the West. Under your directive, Japan would wage war against her classical enemies in China and South-East Asia, seeking hegemony over the Pacific coast. This would culminate into a confrontation with the United states of America, and would ultimately lead to the empire's terrible loss and your terrible shame.",
       "startIntroPart2":"Dutiful Tojo, the forces of Japan once again stand in obediance to the Chrysanthemum Throne. Though Japan's foes are many, her powers are great, and her desire for glory and honour supreme. Can you take charge and lead her Imperial forces once more? Can you build a civilisation that will stand the test of time?",

       "introduction":"I am Hideki Tojo, Prime Minister to the Empire of Japan. You are entering a sacred territory, and I advise that you respect this.",
       "declaringWar":"Today, you are an adversary to Japan, be ready!",
       "attacking":"You decided to become an adversary to Japan. How laughable, the waves will begin, what about you?",
       "defeated":"This brings to me great shame, and to the Empire of Japan great humiliation.",
       "afterPeace":"Peace it is. I hope you have learned something from our encounter.",
       "tradeRequest":"Greetings, I decided to make a trade with you. Is it suitable for you, in your opinion?",

       "outerColor":[180,199,180],
       "innerColor":[181,34,78],

       "uniqueName":"Empire of the Pacific",
       "uniques":
           ["Gains [Science] <for each [Coast] and [Ocean] tiles>, doubled <in conquered cities>. [+50%] [Production] <towards [Naval] units> <in conquered cities>."],
       "cities": ["Tokyo","Osaka","Kyoto","Nagoya","Kanazawa","Hiroshima","Yokohama","Wakayama","Sendai","Tokushima","Hagi","Shuri","Toyama","Kumamoto","Fukuoka","Kobe","Fukui","Kochi","Sakai","Akita","Matsue","Niigata","Takamatsu","Okayama","Shizuoka","Nagasaki","Hakodate","Kagoshima","Akamazeki","Amagasaki","Otaru","Kawasaki","Yokosuka","Sapporo","Sasebo","Kokura","Miyahara","Yahata"],
       "spyNames": ["Amleto","Wellington Roo","Kinoaki","Ma","Itagaki","Masahiko","Kenji","Sadao","Kingoro","Yasuhito"],
  },
  //Manchuria - Nurhaci
   {
       "name":"The Manchus",
       "leaderName":"Nurhaci",
       "adjectives":["Manchurian - Nurhaci"],
       "startBias":["Plains"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The Eight Banners bow down before you, oh great Nurhaci, Brilliant Khan Who Benefits All Nations, unifier of the Manchu peoples! Under your rule, a collection of scattered Jurchen tribes were unified into a great empire! Your reign was a period of great victory and progress for the Manchu people, consisting of constantly successful campaigns against the Ming, the Koreans, the Mongols and other Jurchen tribes. Truly, no empire in East Asia could withstand the might of the Manchu! Your reign is notable for more than sheer conquest, however, with great and important leaps in Manchu culture, such as the funding of the Eight Banners and the creation of a Manchu Alphabet. And your successors would build off your great achievements, conquering the entirety of China and founding one of the greatest dynasties of all time!",
       "startIntroPart2":"Oh, bold and noble Khan and Chieftain, the empire your actions shaped has fallen, and the Manchu have been reduced to a mere minority group in another nation’s empire. But your people call your name unto the heavens, desperate for your strong and wise leadership to lead them to glory once more! Will you ride with your Bannermen to the field of battle once more? Will you build a civilization to stand the test of time?",

       "introduction":"You stand before Nurhaci, Brilliant Khan Who Benefits All Nations. Will you be a worthwhile ally or mere fodder for my armies?",
       "declaringWar":"Your day are numbered, my army and its banners are coming for you!",
       "attacking":"So you have chosen death. Bring forth my army, let's nail them down 'til nothing of them are left.",
       "defeated":"You have bested me, warrior. I have no choice but to submit. Which banner shall I be allocated to? What do you mean, 'we don't sort our troops by banner'?!",
       "afterPeace":"My army and I are trained to fight, but we have a rational mind. Peace is accepted, hope you will be worthwhile next time.",
       "tradeRequest":"Greetings, can we trade with you? Don't worry, it's worth your time.",

       "outerColor":[241,204,53],
       "innerColor":[32,40,113],

       "uniqueName":"Eight Banners",
       "uniques":
           ["[Land] units are randomly assigned with [Red Banner], [Blue Banner], [Yellow Banner], [White Banner], [Black Banner], [Pink Banner], [Green Banner] or [Purple Banner] promotions <upon their construction>. Units received additional [Combat Strength] and [Movement] <when beginning a turn adjacent to a unit of the same promotion>."],
       "cities": ["Mukden","Harbin","Cangcon","Girin","Ningguta","Cicigar","Suniha","Yehe","Tuhe","Sarhu","Jamuhu","Hunehe","Sunggari","Akuri","Musi","Heseri","Giyaliku","Socoro","Hulun","Irkule","Erdun","Nurhan","Bektu","Cinggeri","Janggin","Kersun","Mongguri","Yengge","Silergi","Tanggiya","Ukuri","Supingkai","Boduna","Giyamusi"],
       "spyNames": ["Hong Taiji","Dorgon","Fulin","Xuanye","Yinzhen","Hongli","Yongyan","Minning","Oboi","Cixi"],
  },
  //Manchuria - Puyi
   {
       "name":"Wu Zhou Dynasty",
       "leaderName":"Wu Zetian",
       "adjectives":["Chinese - Wu Zhou"],
       "startBias":["None"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The Blessings of Heaven be upon you. Empress Wu Zetian, most beautiful and haughty ruler of China! Oh great Empress, whose shadow causes the flowers to blossom and the rivers to flow! You are the only empress of the Chinese, the oldest and the greatest civilization that humanity has ever produced. China's history stretches back into the mists of time, its people achieving many great things long before the other upstart civilizations were even conceived. China's contributions to the arts and sciences are too many and too wondrous to do justice to - the printing press, gunpowder, the works of Confucius - these are but a few of the gifts China has given to an undeserving world!",
       "startIntroPart2":"You, great Empress, who, with cunning and beauty, rose from the position of lowly concubine to that of Divine Empress - your people call out to you to lead them! Great China is once again beset on all sides by barbarians. Can you defeat all your many foes and return your country to greatness? Can you build a civilisation that will stand the test of time?",

       "introduction":"Salutations to you, I am Empress of all China, China is not something you can meddling with. We want peace, so do you.",
       "declaringWar":"Oh, believe me, you won't ever be able to bother me one more time! Go meet Yama and say hi to him! Hahahaha!",
       "attacking":"You fool! I will disembowel you all!",
       "defeated":"Oh my, you have proven yourself to me that you are truly a cunning and competent advesary to China. Well, I congratulate you on your victory, but I assured you, China will risen again.",
       "afterPeace":"Well, it seems there's no other options other than peace, oh well, guess it will be commenced.",
       "tradeRequest":"Oh, friend of mine, what do you think of this request of trade?",

       "outerColor":[202,20,21],
       "innerColor":[247,216,1],

       "uniqueName":"Art of War",
       "uniques":
           ["The [Great General] [combat bonus] <is increased> by [15%], and their [spawn rate] <is increased> by [50%]"],
       "cities": ["Luoyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang"],
  },
]
