[
  //China - Qin
  {
       "name":"Qin Dynasty",
       "leaderName":"Qin Shi Huang",
       "adjectives":["Chinese - Qin"],
       "startBias":["None"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Taoism",

       "startIntroPart1":"Oh, wise and mighty Qin Shi Huangdi, the king of Qin and first Emperor of united China. Qin was an ancient Chinese state established in ninth century before Christ. During the early Warring States period, Qin's underdevelopment and decline had resulted in territorial losses to the Wei Kingdom. But then began a time of reformation in the legal, economic and social systems. The aristocracy system was abolished, all slaves granted citizenship rights, and meritocracy was practised in the military. Focus on increasing agricultural output resulted in major population growth, and the possibility of creating a larger army. Qin rose to prominence and emerged as one the dominant superpower among the Seven Warring States. The final advantage they needed to spread their supremacy over all China was a wise king with an unyielding will. You were that unyielding will, and China has been greatful ever since.",
       "startIntroPart2":"The eternal glory of Qin Shi Huang, whose wisdom created countless wonders, many declared impossible, is challenged once more. Can your greatness unify the warring states of Earth and make them one under the heaven? Can you succeed where once you failed, and discover the secret of eternal life? Can you build a civilisation that will stand the test of time?",

       "introduction":"You are allowed to approach the Emperor to within a hundred paces! What an honour for a nameless visitor! Why have you come?",
       "declaringWar":"How dare you enrage the might of heaven! I will send my great army, desecrate your ancestral shrines, eliminate your people. I swear I won't restrain them!",
       "attacking":"Fight me if you have the courage. Soon I will bring my army to teach you a lesson and kill you!",
       "defeated":"I was sure eternal life... would be mine... this... time...",
       "afterPeace":"It seemed that we are equal in strength, might as well stop this to strengthen us more. I would like to see you in the next battle!",
       "tradeRequest":"I decided to give you a piece of my empire to you. Hope you like it.",

       "outerColor":[1,133,135],
       "innerColor":[192,24,64],

       "uniqueName":"All Under Heaven",
       "uniques":
           ["Causes [Resistance] in [enemy cities] if [Qin Dynasty]'s [military power] is <greater than> the [defender]'s <in the area>"],
       "cities": ["Xianyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Luoyang"],
  },
  //China - Wu Zhou
  {
       "name":"Wu Zhou Dynasty",
       "leaderName":"Wu Zetian",
       "adjectives":["Chinese - Wu Zhou"],
       "startBias":["None"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The Blessings of Heaven be upon you. Empress Wu Zetian, most beautiful and haughty ruler of China! Oh great Empress, whose shadow causes the flowers to blossom and the rivers to flow! You are the only empress of the Chinese, the oldest and the greatest civilization that humanity has ever produced. China's history stretches back into the mists of time, its people achieving many great things long before the other upstart civilizations were even conceived. China's contributions to the arts and sciences are too many and too wondrous to do justice to - the printing press, gunpowder, the works of Confucius - these are but a few of the gifts China has given to an undeserving world!",
       "startIntroPart2":"You, great Empress, who, with cunning and beauty, rose from the position of lowly concubine to that of Divine Empress - your people call out to you to lead them! Great China is once again beset on all sides by barbarians. Can you defeat all your many foes and return your country to greatness? Can you build a civilisation that will stand the test of time?",

       "introduction":"Salutations to you, I am Empress of all China, China is not something you can meddling with. We want peace, so do you.",
       "declaringWar":"Oh, believe me, you won't ever be able to bother me one more time! Go meet Yama and say hi to him! Hahahaha!",
       "attacking":"You fool! I will disembowel you all!",
       "defeated":"Oh my, you have proven yourself to me that you are truly a cunning and competent advesary to China. Well, I congratulate you on your victory, but I assured you, China will rise again.",
       "afterPeace":"Well, it seems there's no other options other than peace, oh well, guess it will be commenced.",
       "tradeRequest":"Oh, friend of mine, what do you think of this request of trade?",

       "outerColor":[202,20,21],
       "innerColor":[247,216,1],

       "uniqueName":"Art of War",
       "uniques":
           ["The [Great General] [combat bonus] <is increased> by [15%], and their [spawn rate] <is increased> by [50%]"],
       "cities": ["Luoyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang"],
  },
  //China - Ming
   {
       "name":"Ming Dynasty",
       "leaderName":"Zhu Di (Yongle)",
       "adjectives":["Chinese - Ming"],
       "startBias":["None"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Eternal happiness to you, Yongle, great Emperor of the Ming. Overcoming the treachery of your nephew, the Jianwen Emperor, you launched a campaign to seize China and restore it to greatness. Guided by your loyal and ever-watchful Scholar-Eunuchs, your imperial rule oversaw immeasurable splendour: the construction of great wonders, the advancement of deep knowledge, and the projection of China's power through the legendary Seven Voyages of Zhu Di.",
       "startIntroPart2":"At no other time before would China be so prosperous. Heavenly emperor, the legends of China's great accomplishments threaten to fade into memory. Can you be a patron to scholars and explorers alike? Can you show the world that China is both powerful and wise? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings, I am the Yongle Emperor. Those who trades are all friends of mine, and those who threatens me can only know my wrath upon themselves. So, what bring you to China?",
       "declaringWar":"Conquest is not my forte, or my choice of action. But you proven to me that there's no alternatives, so be prepared.",
       "attacking":"Hahahaha, you might as well conquer the kingdom of heaven! Let's see if your arrows can fly that high, and hurt that much!",
       "defeated":"The road ahead of me is dark, the pines are like walls that blocked my view. The sky above and the earth below, I can't see it as if it was lacquer. I have lost the mandate to rule this land and it passes to you.",
       "afterPeace":"It seems that peace is the only option. And I felt that it is good, I'll let it happened.",
       "tradeRequest":"Greetings, I offer you trade of wealth among us. What do you think of this offer?",

       "outerColor":[1,42,108],
       "innerColor":[247,216,1],

       "uniqueName":"Imperial Eunuchs",
       "uniques":
           ["[Specialists] generate [+2] [Great Person Points] <in cities with a [Spy]>.", "Receive an extra [Spy] <when meeting [50%] of the [city-states]>."],
       "cities": ["Nanjing","Shuntian","Fuzhou","Guangzhou","Guilin","Guiyang","Kaifeng","Wuchang","Nanchang","Xi'an","Jinan","Taiyuan","Chengdu","Kunming","Hangzhou","Fengyang","Baoding","Yanzhou","Pingyang","Luoyang","Fengxiang","Baoning","Ruizhou","Hanyang","Jiande","Xinghua","Zhaoqing","Pingle","Nanning","Anshun"],
       "spyNames": ["Wang","Zhou","Tian","Wu","Nguyen","Gang","Feng","Wei","Liu","Wanli"],
   },
  //China - Republic
   {
       "name":"Republic of China",
       "leaderName":"Sun Yat-sen",
       "adjectives":["Chinese - Republic"],
       "startBias":["None"],
       "preferredVictoryType":"Diplomatic",
       "favoredReligion":"Confucianism",

       "startIntroPart1":"May the glory of China be upon you, glorious Sun Yat-sen, Father of modern China and Forerunner of the Revolution. Influenced much by the ideals you found during your education in Hawaii, after studying medicine, you became a political philosopher, entering revolutionary groups and forming your own, such as the Four Bandits, which grew ever increasingly frustrated with the perceived backwardness of the Qing. After a number of exiles and rebellions, and establishing your political philosophy of the Three Principles of the People, you served as both provisional president and, later, de facto ruler of the Republic of China.",
       "startIntroPart2":"President Sun, the people of China need you once more. One of the only modern leaders of China to be revered in both the modern Republic and People's Republic, they need your strength, tenacity, and courage. Your people call for you once more. Will you be able to live up to your legacy, and build your own Republic without slipping into chaos? Can you build a civilization that will stand the test of time?",

       "introduction":"Hello, I am Sun Yat-sen, representative of this vast, populus republic of China. It may seem like I'm the one in charge here, but I merely speak for the people.",
       "declaringWar":"I do not want any conflict, but you showed that you are untrustworthy, so there's no other options but war.",
       "attacking":"Well, if my words are not enough for you, then force it is. I'll wait for you at the battlefield.",
       "defeated":"You have doomed China for years to come. I was able to successfully unite China for the greater good- just for the people to become divided once more at your hand.",
       "afterPeace":"Peace will be commenced, I waited for this moment for a long time. You showed yourself your skills right there, I'm impressed, to be honest.",
       "tradeRequest":"Hi, I want to inform you of my request of trade. What do you think, is this suitable for you?",

       "outerColor":[164,167,111],
       "innerColor":[176,51,37],

       "uniqueName":"Zhonghua Revival",
       "uniques":
           ["Gain additional [Production] and [Culture] <for each [terrain], [feature] and [improvements] controlled by a city>.", "[Border growth] is doubled <during [Golden Ages]>"],
       "cities": ["Guangzhou","Beijing","Taiyuan","Shanghai","Changsha","Nanjing","Chongqing","Shenyang","Chengdu","Wuhan","Taipei","Kaifeng","Suzhou","Guiyang","Xi'an","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang","Harbin","Uliastai","Fengtian","Xining"],
       "spyNames": ["Song","Huang","Cai","Li","Yang","Yin","Zhang","Wang","He","Qiu"],
  },
  //China - People's Republic
   {
       "name":"People's Republic of China",
       "leaderName":"Mao Zedong",
       "adjectives":["Chinese - People's Republic"],
       "startBias":["None"],
       "preferredVictoryType":"Domination",

       "startIntroPart1":"Salutations, Chairman Mao Zedong. Through your teachings and your leadership, you led a successful revolution in China, ending millennia of dynastic rule, imperialist influence, and internal strife in favor of the world’s most successful Communist state. Embroiled in a civil war against those who saw a different path for China, you made a temporary truce to halt the advance of the imperialist Japanese.  Just a few years after, you took Beijing and formed the People’s Republic of China, now a stable and prosperous state, the most populous country in the world.",
       "startIntroPart2":"Chairman, your people call for you once again. Will you continue to provoke radical thought among your people? Will you help preserve the new China in a world of conflict? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings, Comrade! I am Mao, Chairman of the People's Republic of China.",
       "declaringWar":"Your untrustworthiness showed that no one can ever sided with you. I will let you think of what you've done to China!",
       "attacking":"You! I'll show you the might of the Chinese People's Army!",
       "defeated":"Classes struggle, some classes triumph, others are eliminated. Such is history; such is the history of civilization for thousands of years. *coughs* I feel ill. Call the doctors now!",
       "afterPeace":"Oh well, I do want peace with you for now. I will still watching all your moves and motives.",
       "tradeRequest":"Comrade, are you interested in the wealth I'm trading with you here?",

       "outerColor":[174,38,24],
       "innerColor":[233,210,131],

       "uniqueName":"The Long March",
       "uniques":
           ["[Land] units generate [1] [Culture] per [tile] moved <in enemy territory>.", "Units below [33%] health receive [+1] [Movement] and [+2] [Movement] <when on [Hills] tile>"],
       "cities": ["Beijing","Shanghai","Tianjin","Chongqing","Guangzhou","Shenzhen","Wuhan","Chengdu","Dongguan","Nanjing","Harbin","Xi'an","Senyang","Linzi","Suzhou","Qingdao","Jinan","Zhengzhou","Hangzhou","Dalian","Kunming","Xiamen","Changchun","Nanning","Taiyuan","Hefei","Changzhou","Changsha","Wenzhou","Guiyang","Fuzhou","Shijiazhuang"],
  },
  //Japan - Ashikaga Yoshimitsu
   {
       "name":"Ashikaga Shogunate",
       "leaderName":"Ashikaga Yoshimitsu",
       "adjectives":["Japanese - Yoshimitsu"],
       "startBias":["Hills"],
       "preferredVictoryType":"Religious",
       "favoredReligion":"Shinto",

       "startIntroPart1":"Divine blessings of heaven shower upon you, great Ashikaga Yoshimitsu, Shogun of Japan! Your clan has risen from obscurity to the heights of power, recognised as the true ultimate authority in your fractured country. It was your guidance that brought the rebellious Southern Court to heel, favourably ending the violent imperial schism that had plagued your country for decades. You oversaw the construction of wondrous temples in Kyoto, still recognised as works of beauty to this day. Diplomatically you were unmatched, forging beneficial trade agreements with China and Korea to last a century. Truly, your benevolent guidance brought prosperity to your once fractured realm, and it is no wonder you were known as the true King of Japan!",
       "startIntroPart2":"Great Yoshimitsu, your successors could not replicate your glory. Soon Japan devolved into civil warfare on an unprecedented scale, and the name Ashikaga was tainted with weakness and impotence. Once more Japan needs your steady hand, to assert your birthright as Shogun! Will you restore your people's faith, and bring Japan into a new golden age? Will you build a civilization to stand the test of time?",

       "introduction":"The humble Yoshimitsu, third Shogun of clan Ashikaga, greets you, leader. Japan wishes for peace, but is unmatched in war.",
       "declaringWar":"Your path of action has made your unredeemable. Prepare for war!",
       "attacking":"You don't know your limits, don't you... I will make sure you receive your punishment for being too arrogant.",
       "defeated":"Regrettable... It seems Japan is destined for death and destruction once more...",
       "afterPeace":"The calmness of peace really delighted this humble one. I hope you have learnt your mistakes after the war.",
       "tradeRequest":"Greetings, leader. This humble one offers you a trade offer.",

       "outerColor":[176,143,62],
       "innerColor":[69,35,7],

       "uniqueName":"Five Mountains and Ten Monasteries",
       "uniques":
           ["[Religious] buildings provide additional [Happiness], and are instantly constructed <in annexed cities> <if present in the [Capital]>.","Receive a random [Faith] building <during a [Golden Age]>"],
       "cities": ["Kyoto","Kamakura","Nara","Dazaifu","Gifu","Echizen","Ise","Funai","Ashikaga","Izumo","Kawagoe","Nagano","Yamagata","Fukuhara","Tokushima","Otsu","Tottori","Kokura","Yamaguchi","Tomo","Kiyosu","Katsuyama","Sannohe","Matsumae"],
       "spyNames": ["Takauji","Katsumoto","Moronao","Yoshimasa","Yoriyuki","Masanaga","Masamoto","Takamitsu","Sesshu","Motokiyo"],
  },
  //Japan - Tokugawa Ieyasu
   {
       "name":"Tokugawa Shogunate",
       "leaderName":"Tokugawa Ieyasu",
       "adjectives":["Japanese - Ieyasu"],
       "startBias":["None"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Great Shōgun Tokugawa Ieyasu, you know well that the patient blade is the one that will strike home. Guard your homeland carefully from usurpers domestic and foreign, and trust in the industry and resourcefulness of your people, for they alone can be relied upon. The task of rule is one that is long, and its burdens are heavy, but there is no room for discontent, nor for despair, with your hand upon the sword.",
       "startIntroPart2":"Legendary Daimyo and then Shogun, will you grab the reins of destiny? Will you bring your family and people honor and glory? Will you once again pick up the sword and shield and march to triumph? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings upon you, this humble one is Tokugawa Ieyasu, the Shogun of Japan. Without my commands, nothing will ever happen. What brought you here?",
       "declaringWar":"A sword that has a sharp edge will cut through the empty void, and a breeze blows amidst the raging fire showed its resilience. Between you and me, war is inevitable.",
       "attacking":"Approach me, I dare you, as you need to be cautious. I'll wait for you at the battlefield, and see if you let anywhere unchacked.",
       "defeated":"The grasses of summer is all a warrior can dream of after every battle. And now, it remains in my dreams.",
       "afterPeace":"I respect you and your skills, Japan awaits for the next encounter, peace or war, it will still awaits.",
       "tradeRequest":"Greetings upon you, this humble one requests you of a trade offer. How's that sound?",

       "outerColor":[189,161,27],
       "innerColor":[0,0,0],

       "uniqueName":"Sakoku",
       "uniques":
           ["Gain [1] [Culture], [Science] and [Gold] per tile with [Road], [Railroad] or [Bakuhan]."],
       "cities": ["Edo","Kyoto","Osaka","Nagoya","Fukuoka","Sendai","Shizuoka","Okayama","Takamatsu","Yokohama","Nagano","Otsu","Aomori","Fukushima","Morioka","Hakodate","Kobe","Fukui","Yamagata","Kagoshima","Hiroshima","Matsumoto","Ōta","Sapporo","Nagasaki","Tottori"],
  },
  //Japan - Meiji
  {
       "name":"Japanese Empire",
       "leaderName":"Meiji",
       "adjectives":["Japanese - Meiji"],
       "startBias":["Coast"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Shinto",

       "startIntroPart1":"May the sun rise with you, beloved Meiji Emperor - ruler of the Empire of Japan. When you ascended to the Chrysanthemum Throne at the age of 15, Japan was but a nation suspended in time; divided by its medieval Shogunates and ignorant of the ever Westernising world. During your reign, Japan would undergo one of the most dramatic shifts in history. Opening her borders to trade with the West, Japan would adapt rapidly to the Industrial Revolution of the previous century, reforming her government, her economy, and her armies to meet the standards of modernity. By the time of your death in 1912, Japan had become one of the foremost powers in Asia, setting the stage for a colonial empire that would come to dominate the Pacific.",
       "startIntroPart2":"Great Emperor, Japan stands once more divided and alone. Can you unite the Japanese people as one and embrace them in a golden age to last the ages? Can you build a civilisation that will stand the test of time?",

       "introduction":"You are welcome in the lands of Japan, but you must pledge your honesty and your honour to my name before I would speak with you.",
       "declaringWar":"Your incompetence, your arrogance and your untrustworthiness has led me to the only option I could think, war.",
       "attacking":"I see, you want Japan to succumb in front of you. Well, prepare for the wind of god.",
       "defeated":"It is only I that does this nation great dishonour. I am a servant to my defeat, but I beg you kindness upon my oppressed people.",
       "afterPeace":"Lucky for you that I accept your peace deal, because I hardly make peace without careful consideration.",
       "tradeRequest":"Salutations to you, I am interested in a trade with you. What do you think?",

       "outerColor":[127,0,22],
       "innerColor":[199,169,55],

       "uniqueName":"Imperial Reverence",
       "uniques":
           ["[+20%] [Culture] and [Production] <during [Golden Ages]>.","[Military] units trained <in a [Golden Age]> begins with [+15] [XP]."],
       "cities": ["Tokyo","Osaka","Kyoto","Nagoya","Kanazawa","Hiroshima","Yokohama","Wakayama","Sendai","Tokushima","Hagi","Shuri","Toyama","Kumamoto","Fukuoka","Kobe","Fukui","Kochi","Sakai","Akita","Matsue","Niigata","Takamatsu","Okayama","Shizuoka","Nagasaki","Hakodate","Kagoshima","Akamazeki","Amagasaki","Otaru","Kawasaki","Yokosuka","Sapporo","Sasebo","Kokura","Miyahara","Yahata"],
       "spyNames": ["Kido","Sakamoto","Saigo","Ogaki","Yodo","Kuroishi","Nobuko","Sachiko","Masako","Nakayama"],
  },
  //Japan - Hideki Tojo
  {
       "name":"Great Empire of Japan",
       "leaderName":"Hideki Tojo",
       "adjectives":["Japanese - Hideki Tojo"],
       "startBias":["Coast"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Shinto",

       "startIntroPart1":"Hideki Tojo, by the grace of His Imperial Majesty, Prime Minister to Japan and her empire, you stand at the charge of a burgeoning war machine. At the turn of the 20th century, the Empire of Japan had rapidly transformed into an industrial and military superpower, and she sought now an empire like those possessed in the West. Under your directive, Japan would wage war against her classical enemies in China and South-East Asia, seeking hegemony over the Pacific coast. This would culminate into a confrontation with the United states of America, and would ultimately lead to the empire's terrible loss and your terrible shame.",
       "startIntroPart2":"Dutiful Tojo, the forces of Japan once again stand in obediance to the Chrysanthemum Throne. Though Japan's foes are many, her powers are great, and her desire for glory and honour supreme. Can you take charge and lead her Imperial forces once more? Can you build a civilisation that will stand the test of time?",

       "introduction":"I am Hideki Tojo, Prime Minister to the Empire of Japan. You are entering a sacred territory, and I advise that you respect this.",
       "declaringWar":"Today, you are an adversary to Japan, be ready!",
       "attacking":"You decided to become an adversary to Japan. How laughable, the waves will begin, what about you?",
       "defeated":"This brings to me great shame, and to the Empire of Japan great humiliation.",
       "afterPeace":"Peace it is. I hope you have learned something from our encounter.",
       "tradeRequest":"Greetings, I decided to make a trade with you. Is it suitable for you, in your opinion?",

       "outerColor":[180,199,180],
       "innerColor":[181,34,78],

       "uniqueName":"Empire of the Pacific",
       "uniques":
           ["Gains [Science] <for each [Coast] and [Ocean] tiles>, doubled <in annexed cities>.","[+50%] [Production] <towards [Naval] units> <in annexed cities>."],
       "cities": ["Tokyo","Osaka","Kyoto","Nagoya","Kanazawa","Hiroshima","Yokohama","Wakayama","Sendai","Tokushima","Hagi","Shuri","Toyama","Kumamoto","Fukuoka","Kobe","Fukui","Kochi","Sakai","Akita","Matsue","Niigata","Takamatsu","Okayama","Shizuoka","Nagasaki","Hakodate","Kagoshima","Akamazeki","Amagasaki","Otaru","Kawasaki","Yokosuka","Sapporo","Sasebo","Kokura","Miyahara","Yahata"],
       "spyNames": ["Amleto","Wellington Roo","Kinoaki","Ma","Itagaki","Masahiko","Kenji","Sadao","Kingoro","Yasuhito"],
  },
  //Manchuria - Nurhaci
   {
       "name":"The Manchus",
       "leaderName":"Nurhaci",
       "adjectives":["Manchurian - Nurhaci"],
       "startBias":["Plains"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The Eight Banners bow down before you, oh great Nurhaci, Brilliant Khan Who Benefits All Nations, unifier of the Manchu peoples! Under your rule, a collection of scattered Jurchen tribes were unified into a great empire! Your reign was a period of great victory and progress for the Manchu people, consisting of constantly successful campaigns against the Ming, the Koreans, the Mongols and other Jurchen tribes. Truly, no empire in East Asia could withstand the might of the Manchu! Your reign is notable for more than sheer conquest, however, with great and important leaps in Manchu culture, such as the funding of the Eight Banners and the creation of a Manchu Alphabet. And your successors would build off your great achievements, conquering the entirety of China and founding one of the greatest dynasties of all time!",
       "startIntroPart2":"Oh, bold and noble Khan and Chieftain, the empire your actions shaped has fallen, and the Manchu have been reduced to a mere minority group in another nation’s empire. But your people call your name unto the heavens, desperate for your strong and wise leadership to lead them to glory once more! Will you ride with your Bannermen to the field of battle once more? Will you build a civilization to stand the test of time?",

       "introduction":"You stand before Nurhaci, Brilliant Khan Who Benefits All Nations. Will you be a worthwhile ally or mere fodder for my armies?",
       "declaringWar":"Your day are numbered, my army and its banners are coming for you!",
       "attacking":"So you have chosen death. Bring forth my army, let's nail them down 'til nothing of them are left.",
       "defeated":"You have bested me, warrior. I have no choice but to submit. Which banner shall I be allocated to? What do you mean, 'we don't sort our troops by banner'?!",
       "afterPeace":"My army and I are trained to fight, but we have a rational mind. Peace is accepted, hope you will be worthwhile next time.",
       "tradeRequest":"Greetings, can we trade with you? Don't worry, it's worth your time.",

       "outerColor":[241,204,53],
       "innerColor":[32,40,113],

       "uniqueName":"Eight Banners",
       "uniques":
           ["[Land] units are randomly assigned with [Red Banner], [Blue Banner], [Yellow Banner], [White Banner], [Black Banner], [Pink Banner], [Green Banner] or [Purple Banner] promotions <upon their construction>.","Units received additional [Combat Strength] and [Movement] <when beginning a turn adjacent to a unit of the same promotion>."],
       "cities": ["Mukden","Harbin","Cangcon","Girin","Ningguta","Cicigar","Suniha","Yehe","Tuhe","Sarhu","Jamuhu","Hunehe","Sunggari","Akuri","Musi","Heseri","Giyaliku","Socoro","Hulun","Irkule","Erdun","Nurhan","Bektu","Cinggeri","Janggin","Kersun","Mongguri","Yengge","Silergi","Tanggiya","Ukuri","Supingkai","Boduna","Giyamusi"],
       "spyNames": ["Hong Taiji","Dorgon","Fulin","Xuanye","Yinzhen","Hongli","Yongyan","Minning","Oboi","Cixi"],
  },
  //Manchuria - Puyi
   {
       "name":"Manchuria",
       "leaderName":"Puyi",
       "adjectives":["Manchurian - Puyi"],
       "startBias":["None"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Confucianism",

       "startIntroPart1":"",
       "startIntroPart2":"",

       "introduction":"Welcome to Manchuria, I am Emperor Puyi, the last monarch of China, and I saw you have potential to become our ally.",
       "declaringWar":"I couldn't believe what you did! You and me are no longer potential allies, but enemies!",
       "attacking":"You think I would be scared for that? Although I am, I would still fight against you! Be ready!",
       "defeated":"It seems that... I lost... Well, guess now, I am but a normal man.",
       "afterPeace":"Peace? Oh really? That's great, I am bored of this war already.",
       "tradeRequest":"Hey, I offer you my trade request. Is it good enough for you?",
     
       "outerColor":[225,175,42],
       "innerColor":[20,55,95],

       "uniqueName":"The Final Emperor",
       "uniques":
           ["[Great Person]'s spawn rate <is increased> by [15%].","[Military] units received [+3] [Movement] <when beginning the turn on [Tundra] or [Hills] tiles>."],
       "cities": ["Changchun","Mukden","Harbin","Shenyang","Dalian","Lüshunkuo","Yanbian","Jilin","Qiqihar","Jinzhou","Bei'an","Anshan","Gulian","Hailar","Manzhouli","Baicheng","Fushun","Jiamusi","Hegang","Siping","Yitulihe"],
  },
  //Manchuria - Nobusuke Kishi
  {
       "name":"Manshukoku",
       "leaderName":"Nobusuke Kishi",
       "adjectives":["Manchurian - Nobusuke Kishi"],
       "startBias":["None"],
       "preferredVictoryType":"Economic",
       "favoredReligion":"Shinto",

       "startIntroPart1":"Come greet the rising sun, Nobusuke Kishi, administrator of the most vital frontier of our harmonious empire. Manshukoku was a lawless expanse, the people living in terror of the warlords and their petty feuds, until your predecessors came and established the glorious and orderly state of Manshukoku. From the ashes, overseen by the most able minds our Empire has to offer, industry and prosperity were brought to the lands of Emperor Puyi. But Manshukoku is not simply an example to the world in terms of coal and steel; it offers a new path amidst nationalistic bickering, a new flag which all five races of these lands can salute and be equally proud of what Manshukoku has become.",
       "startIntroPart2":"Mr Kishi, Manshukoku's enemies are numerous, and it is time for the second stage. Hundreds of thousands of tonnes of steel are not enough; we call on you, your novel management techniques, and your friends in the mighty zaibatsu to bring this land to further glory. Will you rise to the challenge? Will your factories and railways be the envy of all Asia? Can you ensure this experiment stands the test of time?",

       "introduction":"Welcome. You stand in the lands of Emperor Puyi and the Five-Coloured Banner... but more importantly, the lands of a wonderful investment opportunity. I am Nobusuke Kishi. Let us take tea.",
       "declaringWar":"You are no longer an ally to Manshukoku, but a new enemy to it. Prepare for your annihilation.",
       "attacking":"That action will be the last action you will do to my face. You are digging your own grave, you scheming snake.",
       "defeated":"Manchukuo may have fallen, but mark my words, I have not. Wait until another enemy knocks at your door, and I assure you, you will be reaching to unlock my cell once more.",
       "afterPeace":"Thanks, it's time for us all be prosperous rather than desperate each other out.",
       "tradeRequest":"Ah, can I offer you a trade? Surely you consider it to be good, isn't it?",
     
       "outerColor":[7,92,146],
       "innerColor":[214,165,2],

       "uniqueName":"Man-Gyo",
       "uniques":
           ["Buildings (except [Wonder]) are constructed [50%] faster <during a [Golden Age]>."],
       "cities": ["Shinkyo","Hoten","Harubin","Tanto","Kitsurin","Anzan","Botanko","Chichiharu","Jamusu","Tsuka","Shihei","Shotoku","Jaranton","Suika","Tsuryo","Bujun","Eiko","Fushin","Hongeiko","Fukin","Sojo","Tonka","Tetsurei","Tonan","Fuyo","Kairin","Seian","Botsuri","Hairaru","Kokuga","Hokuan","Kanto"],
       "spyNames": ["Zheng","Zhang","Kosuke","Ryoko","Chuluunbold","Altantsetseg","Dorgon","Basinu","Kim","Park"],
  },
  //Korea - Seondeok
  {
       "name":"Silla",
       "leaderName":"Seondeok",
       "adjectives":["Korean - Seondeok"],
       "startBias":["Hills"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The stars reveal good omens for you and your people, Queen Seondeok of Silla. With farsightedness and peerless acumen you led your people through the turbulent times that consumed the Korean peninsula during the 6th century AD. As Silla's first-ever queen regnant, you would ensure the her eventual preeminence as the ruler of the land of the morning calm through an alliance with the Tang dynasty. You would also promote an efflorescence of art, learning, and religion, patronizing the construction of many temples and pagodas, as well as that of Cheomseongdae, the tower of the moon and stars, the oldest observatory in the Orient.",
       "startIntroPart2":"Most astute Queen, the alliances you established have faded from memory, and Silla's people starve for want of wisdom. They require a strong, perspicacious leader who will speak unto them the words of blessing written in the heavens. Can you be for Silla this queen once more? Can you build a civilization that will stand the test of time?",

       "introduction":"I, Seondeok, acknowledged you. Our meeting was foreseen.",
       "declaringWar":"The stars foretell me your defeat under my army. Heaven's tells can't be denied.",
       "attacking":"I foresee that your defeat is swift and your nation will be a thing of the past.",
       "defeated":"I foresaw my own end, but not that Silla would share my fate.",
       "afterPeace":"The stars foretell me of peace, that I can't argue. Good thing that heaven saw that was devastating.",
       "tradeRequest":"I want to trade with you, exchange between goods among us.",
     
       "outerColor":[115,27,41],
       "innerColor":[135,181,170],

       "uniqueName":"Path to Doricheon",
       "uniques":
           ["Researching [Technologies] provides [Influence] <with all met [City-states]>","[Academy] yield [Faith] <when worked>"],
       "cities": ["Seorabeol","Yeomhae","Geungi","Namirimdong","Gijeo","Bulsa","Gumi","Yeodam","Horo","Juseon","Uyu","Cheongdo","Andong","Changnyeong","Pohang","Miryang","Ulsan","Sacheon","Sangju","Gyeongsan","Yeondeok","Cheolseong","Wiryeseong","Geoje","Uiseong","Yacheon","Uijin","Taebaek","Samcheok","Donghae","Wonju"],
       "spyNames": ["Chunchu","Yusin","Beobmin","Jigwi","Alcheon","Cheonmyeong","Mishil","Manmyeong","Jindeok","Sohwa"],
  },
  //Korea - Sejong
  {
       "name":"Joseon",
       "leaderName":"Sejong",
       "adjectives":["Korean - Sejong"],
       "startBias":["Coast"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Confucianism",

       "startIntroPart1":"Greetings to you, exalted King Sejong the Great, servant to the people and protector of the Joseon Dynasty! Your glorious vision of prosperity and overwhelming benevolence towards the common man made you the most beloved of all Korean kings. From the earliest days of your reign, the effort you took to provide a fair and just society for all was surpassed only by the technological advances spurred onwards by your unquenched thirst for knowledge. Guided by your wisdom, the scholars of the Jade Hall developed Korea's first written language, Hangul, bringing the light of literature and science to the masses after centuries of literary darkness.",
       "startIntroPart2":"Honorable Sejong, once more the people look to you for guidance. Will you rise to the occasion, bringing harmony and understanding to the people? Can you once again advance your kingdom's standing to such wondrous heights? Can you build a civilization that stands the test of time?",

       "introduction":"Welcome to the court of Joseon, stranger. I am King Sejong Daewang, the one who learned. I look after my citizens with good will. I hope we will have a great discussion.",
       "declaringWar":"The Jiphyeonjeon will no longer tolerate your irksome actions. We will liberate your citizens, even by force, and enlighten them, unlike you.",
       "attacking":"You poor-minded, ignorant and miserable wrench. I will show you the magnificent science of Korea!",
       "defeated":"The question now become who will protect my citizens against the evils when I'm gone. A dark era has come to Korea, thanks to you.",
       "afterPeace":"How can this be possible? What strategy are you implementing here? But in that case, I will allow it.",
       "tradeRequest":"Greetings,we have much to discuss and to benefit from each other.",
     
       "outerColor":[190,12,60],
       "innerColor":[242,158,98],

       "uniqueName":"Scholar of the Jade Hall",
       "uniques":
           ["Gain [Golden Age Points] <from [Specialist] and [Great Person Improvement]>.","Gain [+1] Science <from [Specialist] and [Great Person Improvement]> <during a [Golden Age]>","Receive a free tech <for every time a [Scientific] building, improvement or Wonder is constructed> <in the [Capital]>"],
       "cities": ["Hanseong","Pyongyang","Busan","Daegu","Jeonju","Jinju","Sangju","Kaesong","Taejo","Hamheung","Gongju","Gangneung","Chongjin","Kyongsong","Hwangju","Solme","Seorabeol","Hanyang","Jeollado","Anju","Hoseo","Tamna","Jemulpo","Busosanseong","Samseonghyeol"],
       "spyNames": ["Hwang","Cheol","Seong-ryong","Uiin","Inmok","Sun-shin","Ui-gyeom","Hyowon","Rip","Il"],
  },
  //Korea - Empire
  {
       "name":"Korean Empire",
       "leaderName":"Gojong",
       "adjectives":["Korean - Empire"],
       "startBias":["Coast"],
       "preferredVictoryType":"Diplomatic",
       "favoredReligion":"Confucianism",

       "startIntroPart1":"All of Korea is yours to command, illustrious and valorous Gojong! Having lived through the regency of a father, late did you assume governance of the rapidly crumbling Korean state. Undeterred by foreign threats and internal dangers, you and your beloved wife, Queen-Consort Min, embarked on a journey to bring Korea into the modern age, abolishing the class system, closing down the corrupt seowons, reforming the military, and establishing treaties with nations near and far. These reforms, however, were marred by the queen's grisly murder in 1895. In a final bid to save Korea from her enemies, you christened her an empire not two years later, a move that staved off her ultimate dissolution by a decade.",
       "startIntroPart2":"O Gwangmu Emperor, Korea is once more besieged by false friends and true enemies. Can you steer the ship of state through these troubled waters? Can you bring enlightenment to a land long shrouded in darkness? Can you create a civilization that can stand the test of time?",

       "introduction":"Korea welcomes you, foreign leader, as do I, Gojong, her emperor. I pray that relations between our empires may be cordial, if not harmonious.",
       "declaringWar":"You and your actions made me decided to against you, foreign leader. Let the battles begin!",
       "attacking":"You think Korea would back down? No, let's see if you can bend Korea's knee!",
       "defeated":"How is it that this day has come to pass? I have given everything in my power and more to prevent its coming. Was it still not enough?",
       "afterPeace":"Seems like you still have a mind. I'll accept your peace offer.",
       "tradeRequest":"Greetings, foreign leader. Shall we trade between goods?",
     
       "outerColor":[190,188,167],
       "innerColor":[105,84,5],

       "uniqueName":"Enlightenment of the Land",
       "uniques":
           ["[Specialist] yield [+1] [Production] <for every [5] [Land Trade Route] and [Sea Trade Route]> <in cities>.", "Exchanging [Embassy] or [Open Borders] with another civilization yield [Science] <for both parties>"],
       "cities": ["Hanseong","Pyongyang","Busan","Daegu","Jeonju","Kaesong","Jinju","Sangju","Taejo","Hamheung","Gongju","Gangneung","Chongjin","Kyongsong","Hwangju","Solme","Seorabeol","Hanyang","Jeollado","Anju","Hoseo","Tamna","Jemulpo","Busosanseong","Samseonghyeol"],
       "spyNames": ["Euimin","Yeongseon","Uihwa","Otmar","Haewon","Haeung","Namyeon","Jayoung","Deokhye","Bohyeon","Sunheon"],
  },
  //Korea - Democratic People's Republic
  {
       "name":"Democratic People's Republic of Korea",
       "leaderName":"Kim Il Sung",
       "adjectives":["Korean - Democratic People's Republic"],
       "startBias":["River"],
       "preferredVictoryType":"Domination",

       "startIntroPart1":"The Korean people bow before your presence, President Kim Il Sung. After years of fighting against Japanese imperialists, you emerged as the leader of communist controlled North Korea. Under your leadership, the Korean War was launched in an attempt to reunify the peninsula. However, the initially effective offensive was repelled and the post-war borders have remained to this day. After the wars aftermath, you developed the Juche ideology, stressing self-reliance and isolation, and formed a massive Cult of Personality surrounding yourself and your family. Your policies have remained the guiding principles for North Korea today and for your leadership, you are forever revered as the Eternal President.",
       "startIntroPart2":"Great leader, your return is necessary for a revival in Korea's glory. Can you defend the nation from imperialists and foreign exploitation? Can you foment undying loyalty throughout your populace? Can you build a civilization that will stand the test of time?",

       "introduction":"Greetings comrade. I am Kim il-Sung, president of the Korean people. I am a firm believer in men's control over his destiny. I wonder if ours will cross...",
       "declaringWar":"Your words made me shook my head, we are now not comrades, but adversaries!",
       "attacking":"Be careful what you wished for, because you wouldn't expect what we expected!",
       "defeated":"The Korean people's revolution must go on without me...",
       "afterPeace":"I see... Sure, we will sign, but be aware, because we wouldn't forget about this.",
       "tradeRequest":"Comrades, shall we exchange goods? We got you the best deal we have at the moment.",
     
       "outerColor":[5,17,43],
       "innerColor":[188,63,35],

       "uniqueName":"Military First Policy",
       "uniques":
           ["[Infantry] units, [Gunpowder] units, and [Archery] units are trained [25]% faster <in all cities>.","Buildings that isn't built in the [Capital] is [15]% slower <in cities that is not the [Capital]>","The [Capital] receives [+1] Happiness and [+1] Culture <for 5 [Military] units that [Korea - Democratic People's Republic] posseses>"],
       "cities": ["Pyongyang","Hamhung","Chongjin","Nampo","Wonsan","Tanchon","Sinuiju","Kaechon","Kaesong","Sunchon","Sariwon","Pyongsong","Kanggye","Anju","Haeju","Kimchaek","Hyesan","Chongju","Hoeryong","Kusong","Manpo","Munchon","Rason","Sinpo","Songrim"],
       "spyNames": ["Kim","Park","Han","Na","Kong","Yu","Ahn","Na","Da","Eun"],
  },
  //Korea - First Republic
  {
       "name":"First Republic of Korea",
       "leaderName":"Rhee Syngman",
       "adjectives":["Korean - Republic"],
       "startBias":["River"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Christianity",

       "startIntroPart1":"",
       "startIntroPart2":"",

       "introduction":"Greetings leader, and welcome to the Republic of Korea, a place of great economic prosperity.",
       "declaringWar":"It seems our path is at a crossroad. I may don't have the personnel, but I have strategies, tactics and experiences!",
       "attacking":"That will be a mistake you've thought of. I will bring my army and see if you can handle them all.",
       "defeated":"A shrimp between whales, yet again... does it ever end? Well, whatever, it is not as if your fight for Korea is anywhere near finished, or as if it will ever be.",
       "afterPeace":"An eye for an eye to understand the peace will bring prosper for both of us. And that, I will allow it.",
       "tradeRequest":"Hey leader, do you want to trade?",
     
       "outerColor":[232,226,204],
       "innerColor":[2,43,109],

       "uniqueName":"Independence Through Sheer Force",
       "uniques":
           ["[Infantry] units are trained [15]% faster <in cities with [Barracks]>","Earns [100]% of killed [Military] unit's [Strength] as [Science]"],
       "cities": ["Seoul","Busan","Incheon","Daegu","Daejeon","Gwangju","Ulsan","Suwon","Changwon","Goyang","Seongnam","Yongin","Bucheon","Ansan","Cheongju","Jeonju","Namyangju","Anyang","Cheonan","Hwaseong","Pohang","Gimhae","Uijeongbu","Pyeongatek","Jeju","Gumi","Siheung","Paju","Gwangmyeong","Jinju","Wonju","Iksan","Yeosu","Gunpo","Gunsan","Asan","Chuncheon","Suncheon","Yangsan"],
       "spyNames": ["Kim","Park","Han","Na","Kong","Yu","Ahn","Na","Da","Eun"],
  },
  //Korea - Sixth Republic
  {
       "name":"Sixth Republic of Korea",
       "leaderName":"Kim Dae-jung",
       "adjectives":["Manchurian - Puyi"],
       "startBias":["River"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Catholicism",

       "startIntroPart1":"Hail, Kim Dae-Jung, president of the people of free Korea, for the Blue House awaits your arrival after your long struggle for justice. Korea is a proud nation, the culture of the peninsula, its mountains and bays and great cities, thriving against all odds, as hungry powers from the west, east, and north all looked on Korean lands with envy. Still, your home lies split in two, every Korean from Baekdu to Bukhan forced to live under the yoke of a king of torture and deceit. For a time, so were the southern lands, until you led the people in their cry for freedom. Now democratic at last, you must guide the south through the trials of this world, and indeed, with its often-admired industry and fearsome cultural power, your people are as prepared as can be.",
       "startIntroPart2":"Mr President, the tasks ahead are numerous, but they are not impossible. Korea has come so far; a strong, independent, thriving Korea, free from all division imposed by outsiders, is in your grasp. Can you achieve the dream at last? Can you build a civilisation that stands the test of time?",

       "introduction":"Free Korea welcomes you, whoever you may be. I am this country's president, and I sincerely hope our relationship will lead to peace and prosperity for us both.",
       "declaringWar":"I have to declare war on you, you made a bad example to this world, and you should be eradicated!",
       "attacking":"That threat can't stop progression of Korea! I will show you that Korea can against its threats!",
       "defeated":"How has my country fallen? We were proud and strong - you have taken that away from the world.",
       "afterPeace":"Finally, you have come for your senses. I am happy that we made peace today.",
       "tradeRequest":"Hey, you want something that satisfy you here? We got this deal for you right here.",
     
       "outerColor":[1,15,86],
       "innerColor":[64,173,121],

       "uniqueName":"March for the Beloved",
       "uniques":
           ["Receive a [Population] bonus <when capturing and holding an enemy city>","[+5] Culture <for annexed cities>","Receive the best [Military] unit available <for annexed cities with [≥2] Population>", "Instantly heal <for annexed cities with [≥3] Population>", "Receive an extra [Defensive] building <for annexed cities with [≥4] Population>"],
       "cities": ["Seoul","Gwangju","Busan","Daegu","Incheon","Daejeon","Changwon","Ulsan","Suwon","Cheongju","Jeonju","Chuncheon","Jeju City","Seongnam","Iksan","Pohang","Goyang","Yeosu","Cheonan","Bucheon","Gunsan","Gumi","Anyang","Suncheon","Jinju","Ansan","Mokpo","Gimhae","Yongin","Haui"],
       "spyNames": ["Yi","Choi","Kang","Jang","Shin","Lee","Jeong","Yun","Im","Yu"],
 },
  //Vietnam - Ly Dynasty
  {
       "name":"Dai Viet",
       "leaderName":"Ly Thai To (Ly Cong Uan)",
       "adjectives":["Vietnamese - Ly Dynasty"],
       "startBias":["River"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"",
       "startIntroPart2":"",

       "introduction":"Welcome to Manchuria, I am Emperor Puyi, the last monarch of China, and I saw you have potential to become our ally.",
       "declaringWar":"I couldn't believe what you did! You and me are no longer potential allies, but enemies!",
       "attacking":"You think I would be scared for that? Although I am, I would still fight against you! Be ready!",
       "defeated":"It seems that... I lost... Well, guess now, I am but a normal man.",
       "afterPeace":"Peace? Oh really? That's great, I am bored of this war already.",
       "tradeRequest":"Hey, I offer you my trade request. Is it good enough for you?",
     
       "outerColor":[225,175,42],
       "innerColor":[20,55,95],

       "uniqueName":"Nam Quoc Son Ha",
       "uniques":
           ["Recieves [Culture] <when attacking cities>","[Sword], [Melee] and [Cavalry] units recieves [+15] XP <when constructed in cities with [Barracks]>"],
       "cities": ["Co Loa","Thang Long","Thanh Hoa","Bac Giang","Thanh Dong","Hai Phong","Thai Nguyen","My Linh","Bac Ninh","Thai Binh","Phu Xuan","Ha Tinh","Tien Dien","Ninh Binh","Duong Lam","Cao Bang","Dong Hoi","Ha Long","Hung Yen","Yen Bai","Son Tay","Tuyen Quang","Hong Linh","Hoa Binh","Chi Linh","Phuc Yen","Dong Ha","Son La","Lao Cai","Ha Giang","Cao Bang","Lang Son","Cam Pha","Phu Ly","Thai Hoa","Hoang Mai","Sam Son","Tu Son","Hong Ky","Dong Lac","Trung Hoa","An Khai","Gia Dong","Phu Cuong","Quang Tri","Quang Dong","Hong Linh","Nghi Van","Bim Son","Hoi An"],
  },
  //Vietnam - Tran Dynasty
    {
       "name":"Dai Viet",
       "leaderName":"Tran Thanh Tong",
       "adjectives":["Vietnamese - Tran Dynasty"],
       "startBias":["River","Avoid [Tundra]","Avoid [Desert]"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Heaven's fortunes be upon you Tran Thanh Tong. You inherited your father's Empire, his legacy, and his enemies. The Mongols controlled China to the north and looked greedily towards your lands. They came three times. Each you, your brother, and the noble Viet people fended them off. But winning wars against great odds was not the only feat you achieved. You built up the grand citadels of Thang Long, Thanh Hoa, and Thanh Dong. You patronised the arts and sciences, bringing Dai Viet into a new age of prosperity and even introducing the first exclusively Viet written language allowing your court to write in its own way rather than that of China. The Tran dynasty would rule on in prosperity from the foundations you built and feats you achieved.",
       "startIntroPart2":"Great Tran Thanh Tong, the Viets call to you once more. Will you answer them and fend off the empires at the gates and be a champion of science and culture once more? Can you build an empire to stand the test of time?",

       "introduction":"The mist parts and I greet you friend. Welcome to Dai Viet, a realm born of Dragons and Fairies. I am it's ruler Tran Thanh Tong.",
       "declaringWar":"You and your ambitions know no limits! I will brought you to your fitting with force! Just wait you ignorant!",
       "attacking":"I will make sure you will regret this! Prepare to be amazed!",
       "defeated":"You have fell my empire. You have killed my soldiers. And for what? The Viet people will remember. They will rise up again, as they have done in past. This is a shallow victory, you should enjoy it while you can.",
       "afterPeace":"Seems like you have a change of mind? Well, we preferred peace so we accept but next time won't be the same.",
       "tradeRequest":"We Viets want to trade with you. Is this deal suitable for your view?",
     
       "outerColor":[33,65,52],
       "innerColor":[214,216,107],

       "uniqueName":"Dance of Flowers",
       "uniques":
           ["[Mounted] units gain defensive terrain bonus","[Science] building gains [Culture] bonus <when constructing>","[Culture] building gains [Science] bonus <when constructing>"],
       "cities": ["Thang Long","Thanh Hoa","Bac Giang","Thanh Dong","Hai Phong","Thai Nguyen","Bac Ninh","Thai Binh","Phu Xuan","Ha Tinh","Tien Dien","Ninh Binh","Duong Lam","Cao Bang","Dong Hoi","Ha Long","Hung Yen","Yen Bai","Son Tay","Tuyen Quang","Hong Linh","Hoa Binh","Chi Linh","Phuc Yen","Dong Ha","Son La","Lao Cai","Ha Giang","Cao Bang","Lang Son","Cam Pha","Phu Ly","Thai Hoa","Hoang Mai","Sam Son","Tu Son","Hong Ky","Dong Lac","Trung Hoa","An Khai","Gia Dong","Phu Cuong","Quang Tri","Quang Dong","Hong Linh","Nghi Van","Bim Son","Hoi An"],
       "spyNames": ["Tu Lo","Man Giac","Dieu Nhan","Chan Khong","Ngo An","Vien Chieu","Cuu Chi","Van Hanh","Khuong Viet","Phap Thuan"],
  },
  //Vietnam - Later Le Dynasty (Le So Dynasty)
  {
       "name":"Dai Viet",
       "leaderName":"Le Loi",
       "adjectives":["Vietnamese - Le So Dynasty"],
       "startBias":["River"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Hail Le Loi, great hero of the Vietnamese people and founder of the Le Dynasty! You led the people of the Vietnamese countryside in an uprising that would throw off the violent oppression foisted upon them by the Ming Empire. After many battles, over 10 years, you restored the sovereignty of Dai Viet. Though you reigned as King for only five years, during your rule you greatly improved the lives of your people with improvements to infrastructure and rewards to those who fought for Vietnamese independence. In the end, it was illness that ended your reign. Since then you have been revered as a legendary leader by the people of Vietnam.",
       "startIntroPart2":"The time has come for Dai Viet to carve out a land for herself once again. Great leader, will you rally your people once again and lead them to greatness? With your sword from the Golden Turtle, will you cut down those who would do you harm? Will you build a civilization that will stand the test of time?",

       "introduction":"Entering the lands of Dai Viet is truly surreal for a man. Welcome, and I, Le Loi, will open my hands to greet you for the first time.",
       "declaringWar":"Your ambitions are off limit, yet you couldn't control it, don't you? Let me handle it for you.",
       "attacking":"Hah, your words are nothing but words. Let's go to the battlefield to see who is better!",
       "defeated":"One failed step of mine is one step for generations after me to succeed. You are not eternal, so mark my words.",
       "afterPeace":"What a battle! I gotta said, your skills on the battlefield are great, but now, it is time for peace. Hope to see you later, not as enemies to each other, but friends.",
       "tradeRequest":"I, Le Loi, wants to trade with you. Is that good for you?",
     
       "outerColor":[203,184,45],
       "innerColor":[68,14,48],

       "uniqueName":"Battle of Chi Lang",
       "uniques":
           ["Earn a free [Great General] <when constructing a Wonder>.","[Military] units receives [+5]% Combat Strength <when embarking>","[Sword] units receives [+5]% Combat Strength <vs [Military] units> <when beginning a turn adjacent to a [Mountain] tile>"],
       "cities": ["Thang Long","Thanh Hoa","Bac Giang","Thanh Dong","Hai Phong","Thai Nguyen","Bac Ninh","Thai Binh","Phu Xuan","Ha Tinh","Tien Dien","Ninh Binh","Duong Lam","Cao Bang","Dong Hoi","Ha Long","Hung Yen","Yen Bai","Son Tay","Tuyen Quang","Hong Linh","Hoa Binh","Chi Linh","Phuc Yen","Dong Ha","Son La","Lao Cai","Ha Giang","Cao Bang","Lang Son","Cam Pha","Phu Ly","Thai Hoa","Hoang Mai","Sam Son","Tu Son","Hong Ky","Dong Lac","Trung Hoa","An Khai","Gia Dong","Phu Cuong","Quang Tri","Quang Dong","Hong Linh","Nghi Van","Bim Son","Hoi An"],
  },
  //Vietnam - Nguyen Dynasty
  {
       "name":"Dai Nam",
       "leaderName":"Nguyen Phuc Dam (Minh Mang)",
       "adjectives":["Vietnamese - Nguyen Dynasty"],
       "startBias":["None"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"",
       "startIntroPart2":"",

       "introduction":"Dai Nam welcomes you, I am Minh Mang, Emperor of Dai Nam, and I see that we met for the first time.",
       "declaringWar":"Your actions made me sick of you! Get out, and I will see you on the battlefield!",
       "attacking":"Ridiculous! Frivolous! What an audacity! I'll see you if you can fly to heaven to bring a dragon down!",
       "defeated":"How... how... how?! O heaven and earth, what have I done to deserve this fate! What have I done?! You will know we Viets will prevail forever and ever!",
       "afterPeace":"Offer of peace accepted, for I will commence it. Brilliant of you to offer peace to end this senseless conflict between us leaders.",
       "tradeRequest":"We offer you the offer of trade to you. Is it delectable for you?",
     
       "outerColor":[85,28,43],
       "innerColor":[203,192,130],

       "uniqueName":"Be Quan Toa Cang",
       "uniques":
           ["Can't train [Caravan], [Great Merchant]", "[+5] Culture <when constructing [University]>","[+15] Culture <when constructing [Academy]","[Military] units receives [-15] Combat Strength <vs [Military] units> <when beginning a turn adjacent to a [Coast] tile>"],
       "cities": ["Phu Xuan","Thang Long","Thanh Hoa","Bac Giang","Thanh Dong","Hai Phong","Thai Nguyen","Bac Ninh","Thai Binh","Thua Thien","Ha Tinh","Tien Dien","Ninh Binh","Duong Lam","Cao Bang","Dong Hoi","Ha Long","Hung Yen","Yen Bai","Son Tay","Tuyen Quang","Hong Linh","Hoa Binh","Chi Linh","Phuc Yen","Dong Ha","Son La","Lao Cai","Ha Giang","Cao Bang","Lang Son","Cam Pha","Phu Ly","Thai Hoa","Hoang Mai","Sam Son","Tu Son","Hong Ky","Dong Lac","Trung Hoa","An Khai","Gia Dong","Phu Cuong","Quang Tri","Quang Dong","Hong Linh","Nghi Van","Bim Son","Hoi An"],
  },
  //Vietnam - Socialist Republic
  {
       "name":"Socialist Republic of Vietnam",
       "leaderName":"Ho Chi Minh",
       "adjectives":["Vietnamese - Socialist Republic"],
       "startBias":["Jungle"],
       "preferredVictoryType":"Diplomatic",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Greetings, comrade Ho Chi Minh, great leader of Vietnam. You pioneered the cause for Vietnamese independence from imperial forces, and fought hard for your cause. You are best known for overseeing the textbook case for guerella warfare; a brutal yet subtle campaign against the country you once idolised. While you did not live to see victory, your role in driving the Vietnamese people is inarguable and your pursuit of a socialism independent of the ideologies of China and the Soviets succeeded.",
       "startIntroPart2":"Dear Uncle, your people clamour for your return. Will you place your people into your heart once more? Will you overcome the oppressors surrounding Vietnam, to establish a free and independent nation? Will you build a civilization to stand the test of time?",

       "introduction":"Welcome to Vietnam, the land where the locals fought for independence. Introduce yourself, and then, we will have some  tea.",
       "declaringWar":"I will declare war on you, I saw your ambitions are not intended for good. Prepare for the war, my adversary.",
       "attacking":"I can sense that this act is to bring Vietnam back to its chains. Well, we will be ready to fight, we won't be afraid of you, tyrant.",
       "defeated":"Even if the rocks eroded away, the rivers dried up and the seas is gone, but the spirits of us Vietnamese won't be suppressed, and we will rise again.",
       "afterPeace":"I see that you want peace? Me too. We do not want to have this war anyway.",
       "tradeRequest":"Can we talk about trade? How about this deal? Is it good?",
     
       "outerColor":[133,27,39],
       "innerColor":[225,156,53],

       "uniqueName":"Truong Son Trail",
       "uniques":
           ["[Military] units can use [Roads] and [Railroads] <when in enemy territory>.","[Great General] can construct [Roads] <when in [Jungle], [Forest], or [Hills] tiles>"],
       "cities": ["Hanoi","Saigon","Hai Phong","Da Nang","Can Tho","Bien Hoa","Nha Trang","Vinh","Hai Duong","Hue","Da Lat","Buon Ma Thuot","Thai Nguyen","Vung Tau","Quy Nhon","Long Xuyen","Viet Tri","Bac Ninh","Thu Dau Mot","Thai Binh","Phan Thiet","Rach Gia","Tam Ky","My Tho","Ca Mau","Ha Long","Thanh Hoa","Cam Pha","Nam Dinh","Bac Liue","Pleiku","Soc Trang","Tuy Hoa","Tan An","Dong Hoi","Sam Son","Lang Son","Vinh Long","Hoi An","Son La","Phan Rang - Thap Cham"],
       "spyNames": ["Quang","Xuan An","Phong","An Dung","Hieu","Trieu","Hien","Ngoc","Tuan","Vien"],
  },
  //Vietnam - Republic
  {
       "name":"Republic of Vietnam",
       "leaderName":"Ngo Dinh Diem",
       "adjectives":["Vietnamese - Republic"],
       "startBias":["None"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Catholicism",

       "startIntroPart1":"Salutations, President Ngo Dinh Diem, leader of the free Vietnamese people! Under your powerful and iron-fisted rule, you attempted to forge South Vietnam into a modern powerhouse amidst its growing conflict with the communist North. Establishing closer ties with America and other Western democracies, your rule was still fraught with both communist sabotage and civil strife between Buddhists and Catholics. And as the Americans realized that you were outside of their control, you were ultimately overthrown and murdered in a coup d'etat. Even your sworn communist enemies 'could scarcely believe the Americans would be so stupid', and publicly acknowledged your strength. Indeed, the coup was not the last to befall South Vietnam, and the carnage that would befall your nation had only just begun...",
       "startIntroPart2":"President Diem, your people yearn for your guiding hand once more, to lead them into this brave new world. Can you establish a mighty nation capable of crushing its enemies? Will you form the diplomatic ties needed to secure your power? Can you build a civilization to stand the test of time?",

       "introduction":"Ah, welcome! You are in the land of the Vietnamese, and I am their president, Ngo Dinh Diem. I hope we can be allies in our needs.",
       "declaringWar":"You thought I didn't see the evil in you? Hah, you are too ambitious for this world, you must be perished.",
       "attacking":"Blasphemous! You think your words have values here?! Well, you needed to be teach a lesson!",
       "defeated":"Thanks to you, Vietnam fell into chaos, I'm assured you that you will regret this day!",
       "afterPeace":"Sure, let's make peace in Vietnam and continue our progress as usual.",
       "tradeRequest":"The Republic of Vietnam wants to trade with you. I can assure you this deal is good, you won't regret it.",
     
       "outerColor":[235,151,26],
       "innerColor":[141,40,54],

       "uniqueName":"Military Assistant Command",
       "uniques":
           ["[Great General]'s spawn rate <is increased> by [5%].","[Armoured] units can receive [-5]% Strength <when on [Forest] and [Jungle] tiles>"],
       "cities": ["Saigon","Hue","Da Nang","Can Tho","Bien Hoa","Nha Trang","Hoi An","Ban Me Thuot","Ia Drang","Qui Nhon","Vung Tau","Da Lat","Khe Sanh","Cam Ranh","Long Xuyen","Thu Dau Mot","Phan Thiet","Rach Gia","Tam Ky","My Tho","Ca Mau","Bac Lieu","Pleiku","Soc Trang","Tuy Hoa","Tan An","Vinh Long","Phu Quoc","Con Son","Ham Tan","Quang Tri","Quang Ngai","Kontum","Hau Bon","Phan Rang - Thap Cham","Phuoc Long","Sa Dec","Khiem Cuong","Chau Doc"],
       "spyNames": ["Trien","Khoi","Ma Tuyen","Vy","Tho","Thuc","Can","Luyen","Loan","Madame Nhu"],
  },
]
