[
  //China - Qin
  {
       "name":"Qin Dynasty",
       "leaderName":"Qin Shi Huang",
       "adjectives":["Chinese - Qin"],
       "startBias":["None"],
       "preferredVictoryType":"Domination",
       "favoredReligion":"Taoism",

       "startIntroPart1":"Oh, wise and mighty Qin Shi Huangdi, the king of Qin and first Emperor of united China. Qin was an ancient Chinese state established in ninth century before Christ. During the early Warring States period, Qin's underdevelopment and decline had resulted in territorial losses to the Wei Kingdom. But then began a time of reformation in the legal, economic and social systems. The aristocracy system was abolished, all slaves granted citizenship rights, and meritocracy was practised in the military. Focus on increasing agricultural output resulted in major population growth, and the possibility of creating a larger army. Qin rose to prominence and emerged as one the dominant superpower among the Seven Warring States. The final advantage they needed to spread their supremacy over all China was a wise king with an unyielding will. You were that unyielding will, and China has been greatful ever since.",
       "startIntroPart2":"The eternal glory of Qin Shi Huang, whose wisdom created countless wonders, many declared impossible, is challenged once more. Can your greatness unify the warring states of Earth and make them one under the heaven? Can you succeed where once you failed, and discover the secret of eternal life? Can you build a civilisation that will stand the test of time?",

       "introduction":"You are allowed to approach the Emperor to within a hundred paces! What an honour for a nameless visitor! Why have you come?",
       "declaringWar":"How dare you enrage the might of heaven! I will send my great army, desecrate your ancestral shrines, eliminate your people. I swear I won't restrain them!",
       "attacking":"Fight me if you have the courage. Soon I will bring my army to teach you a lesson and kill you!",
       "defeated":"I was sure eternal life... would be mine... this... time...",
       "afterPeace":"It seemed that we are equal in strength, might as well stop this to strengthen us more. I would like to see you in the next battle!",
       "tradeRequest":"I decided to give you a piece of my empire to you. Hope you like it.",

       "outerColor":[1,133,135],
       "innerColor":[192,24,64],

       "uniqueName":"All Under Heaven",
       "uniques":
           ["Causes [Resistance] in [enemy cities] if [Qin Dynasty]'s [military power] <in the area> is <greater than> the [defender]'s"],
       "cities": ["Xianyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Luoyang"],
  },
  //China - Wu Zhou
  {
       "name":"Wu Zhou Dynasty",
       "leaderName":"Wu Zetian",
       "adjectives":["Chinese - Wu Zhou"],
       "startBias":["None"],
       "preferredVictoryType":"Scientific",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"The Blessings of Heaven be upon you. Empress Wu Zetian, most beautiful and haughty ruler of China! Oh great Empress, whose shadow causes the flowers to blossom and the rivers to flow! You are the only empress of the Chinese, the oldest and the greatest civilization that humanity has ever produced. China's history stretches back into the mists of time, its people achieving many great things long before the other upstart civilizations were even conceived. China's contributions to the arts and sciences are too many and too wondrous to do justice to - the printing press, gunpowder, the works of Confucius - these are but a few of the gifts China has given to an undeserving world!",
       "startIntroPart2":"You, great Empress, who, with cunning and beauty, rose from the position of lowly concubine to that of Divine Empress - your people call out to you to lead them! Great China is once again beset on all sides by barbarians. Can you defeat all your many foes and return your country to greatness? Can you build a civilisation that will stand the test of time?",

       "introduction":"Salutations to you, I am Empress of all China, China is not something you can meddling with. We want peace, so do you.",
       "declaringWar":"Oh, believe me, you won't ever be able to bother me one more time! Go meet Yama and say hi to him! Hahahaha!",
       "attacking":"You fool! I will disembowel you all!",
       "defeated":"Oh my, you have proven yourself to me that you are truly a cunning and competent advesary to China. Well, I congratulate you on your victory, but I assured you, China will risen again.",
       "afterPeace":"Well, it seems there's no other options other than peace, oh well, guess it will be commenced.",
       "tradeRequest":"Oh, friend of mine, what do you think of this request of trade?",

       "outerColor":[202,20,21],
       "innerColor":[247,216,1],

       "uniqueName":"Art of War",
       "uniques":
           ["The [Great General] [combat bonus] <is increased> by [15%], and their [spawn rate] <is increased> by [50%]"],
       "cities": ["Luoyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang"],
  },
  //China - Ming
   {
       "name":"Ming Dynasty",
       "leaderName":"Zhu Di (Yongle)",
       "adjectives":["Chinese - Ming"],
       "startBias":["None"],
       "preferredVictoryType":"Cultural",
       "favoredReligion":"Buddhism",

       "startIntroPart1":"Eternal happiness to you, Yongle, great Emperor of the Ming. Overcoming the treachery of your nephew, the Jianwen Emperor, you launched a campaign to seize China and restore it to greatness. Guided by your loyal and ever-watchful Scholar-Eunuchs, your imperial rule oversaw immeasurable splendour: the construction of great wonders, the advancement of deep knowledge, and the projection of China's power through the legendary Seven Voyages of Zhu Di.",
       "startIntroPart2":"At no other time before would China be so prosperous. Heavenly emperor, the legends of China's great accomplishments threaten to fade into memory. Can you be a patron to scholars and explorers alike? Can you show the world that China is both powerful and wise? Can you build a civilisation that will stand the test of time?",

       "introduction":"Greetings, I am the Yongle Emperor. Those who trades are all friends of mine, and those who threatens me can only know my wrath upon themselves. So, what bring you to China?",
       "declaringWar":"Conquest is not my forte, or my choice of action. But you proven to me that there's no alternatives, so be prepared.",
       "attacking":"Hahahaha, you might as well conquer the kingdom of heaven! Let's see if your arrows can fly that high, and hurt that much!",
       "defeated":"The road ahead of me is dark, the pines are like walls that blocked my view. The sky above and the earth below, I can't see it as if it was lacquer. I have lost the mandate to rule this land and it passes to you.",
       "afterPeace":"It seems that peace is the only option. And I felt that it is good, I'll let it happened.",
       "tradeRequest":"Greetings, I offer you trade of wealth among us. What do you think of this offer?",

       "outerColor":[1,42,108],
       "innerColor":[247,216,1],

       "uniqueName":"Imperial Eunuchs",
       "uniques":
           ["[Specialists] generate [+2] [Great Person Points] <in cities with a [Spy]>. Receive an extra [Spy] <when meeting [50%] of the [city-states]> and <when meeting [100%] of the [city-states]>."],
       "cities": ["Nanjing","Shuntian","Fuzhou","Guangzhou","Guilin","Guiyang","Kaifeng","Wuchang","Nanchang","Xi'an","Jinan","Taiyuan","Chengdu","Kunming","Hangzhou","Fengyang","Baoding","Yanzhou","Pingyang","Luoyang","Fengxiang","Baoning","Ruizhou","Hanyang","Jiande","Xinghua","Zhaoqing","Pingle","Nanning","Anshun"],
       "spyNames": ["Wang","Zhou","Tian","Wu","Nguyen","Gang","Feng","Wei","Liu","Wanli"],
   },
  //China - Republic
   {
       "name":"Republic of China",
       "leaderName":"Sun Yat-sen",
       "adjectives":["Chinese - Republic"],
       "startBias":["None"],
       "preferredVictoryType":"Diplomatic",
       "favoredReligion":"Confucianism",

       "startIntroPart1":"May the glory of China be upon you, glorious Sun Yat-sen, Father of modern China and Forerunner of the Revolution. Influenced much by the ideals you found during your education in Hawaii, after studying medicine, you became a political philosopher, entering revolutionary groups and forming your own, such as the Four Bandits, which grew ever increasingly frustrated with the perceived backwardness of the Qing. After a number of exiles and rebellions, and establishing your political philosophy of the Three Principles of the People, you served as both provisional president and, later, de facto ruler of the Republic of China.",
       "startIntroPart2":"President Sun, the people of China need you once more. One of the only modern leaders of China to be revered in both the modern Republic and People's Republic, they need your strength, tenacity, and courage. Your people call for you once more. Will you be able to live up to your legacy, and build your own Republic without slipping into chaos? Can you build a civilization that will stand the test of time?",

       "introduction":"Hello, I am Sun Yat-sen, representative of this vast, populus republic of China. It may seem like I'm the one in charge here, but I merely speak for the people.",
       "declaringWar":"I do not want any conflict, but you showed that you are untrustworthy, so there's no other options but war.",
       "attacking":"Well, if my words are not enough for you, then force it is. I'll wait for you at the battlefield.",
       "defeated":"You have doomed China for years to come. I was able to successfully unite China for the greater good- just for the people to become divided once more at your hand.",
       "afterPeace":"Peace will be commenced, I waited for this moment for a long time. You showed yourself your skills right there, I'm impressed, to be honest.",
       "tradeRequest":"Hi, I want to inform you of my request of trade. What do you think, is this suitable for you?",

       "outerColor":[164,167,111],
       "innerColor":[176,51,37],

       "uniqueName":"Zhonghua Revival",
       "uniques":
           ["Gain additional [Production] and [Culture] <for each [terrain], [feature] and [improvements] controlled by a city>. [Border growth] is doubled <during [Golden Ages]>"],
       "cities": ["Luoyang","Chang'an","Taiyuan","Jiaodong","Changsha","Longxi","Handan","Shenyang","Shanghai","Wuhan","Xiurong","Xingzhou","Yuyang","Linzi","Jiangzhou","Guangzhou","Tianjin","Suzhou","Hangzhou","Weifang"],
  },
]
